microchip-pic-avr-examples/dspic33a-dual-partition-code-examples/dspic33ak512mps512_dual_partition_demo/example0/shared_code/command.c
/*
(c) [2025] Microchip Technology Inc. and its subsidiaries.

    Subject to your compliance with these terms, you may use Microchip 
    software and any derivatives exclusively with Microchip products. 
    You are responsible for complying with 3rd party license terms  
    applicable to your use of 3rd party software (including open source  
    software) that may accompany Microchip software. SOFTWARE IS ?AS IS.? 
    NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS 
    SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT,  
    MERCHANTABILITY, OR FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT 
    WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, 
    INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY 
    KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF 
    MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE 
    FORESEEABLE. TO THE FULLEST EXTENT ALLOWED BY LAW, MICROCHIP?S 
    TOTAL LIABILITY ON ALL CLAIMS RELATED TO THE SOFTWARE WILL NOT 
    EXCEED AMOUNT OF FEES, IF ANY, YOU PAID DIRECTLY TO MICROCHIP FOR 
    THIS SOFTWARE.
*/

#include <stddef.h>

/* cppcheck-suppress misra-c2012-21.6
 * 
 *  (Rule 21.6) Required: The standard library input/output functions shall 
 *  not be used
 * 
 *  Use of stdio.h is required in order to run this terminal based demo. 
 *  This demo is for learning purposes only. However in production code, 
 *  stdio.h should be avoided, as streams and file I/O functions lack type 
 *  safety and have undefined and unspecified behavior at run time. 
 */
#include <stdio.h>
#include <string.h>
#include <stdbool.h>
#include "xc.h"
#include "bsp/led0.h"
#include "bsp/led7.h"

#include "mcc_generated_files/flash/flash_types.h"
#include "mcc_generated_files/flash/flash_nonblocking.h"
#include "mcc_generated_files/uart/uart1.h"
#include "mcc_generated_files/timer/tmr1.h"

#include "reset.h"
#include "partition.h"
#include "scan.h"
#include "command.h"
#include "flash_regions/flash_region.h"
#include "flash_regions/flash_region_0.h"
#include "flash_regions/flash_region_1.h"
#include "flash_regions/flash_region_2.h"
#include "flash_regions/flash_region_3.h"
#include "flash_regions/flash_region_4.h"
#include "flash_regions/flash_region_5.h"
#include "flash_regions/flash_region_6.h"
#include "flash_regions/flash_region_7.h"

#define ACTIVE_PARTITION_BASE_ADDRESS 0x800000UL
#define INACTIVE_PARTITION_BASE_ADDRESS 0xC00000UL

#define ACTIVE_SEQUENCE_NUMBER_ADDRESS 0x83FFF0UL
#define ACTIVE_SEQUENCE_NUMBER_PAGE 0x83F000UL

#define INACTIVE_SEQUENCE_NUMBER_ADDRESS 0xC3FFF0UL
#define INACTIVE_SEQUENCE_NUMBER_PAGE 0xC3F000UL

#define DEMO_PARTITION_SIZE 0x10000UL

#define FLASH_INSTRUCTION_SIZE_IN_BYTES (4UL)
#define FLASH_ERASE_PAGE_SIZE_IN_BYTES (FLASH_ERASE_PAGE_SIZE_IN_INSTRUCTIONS * 4UL)
#define FLASH_WRITE_SIZE_IN_BYTES (4UL * FLASH_INSTRUCTION_SIZE_IN_BYTES)    //4 instructions written at a time

#define PRINT_REGION_SIZE 128

/******************************************************************************/
/* Extern Function Prototypes                                                 */
/******************************************************************************/
extern void BreakpointExample(void);
extern void BootSwap(void);

/******************************************************************************/
/* Private Function Prototypes                                                */
/******************************************************************************/
static bool GetRegionSelection(uint8_t* regionNum);
static void UnlockRegion(void);
static void LockRegion(void);
static void LockRegionUntilReset(void);
static void EraseActiveTestArea(void);
static void EraseInactiveTestArea(void);
static void PrintActiveTestArea(void);
static void PrintInactiveTestArea(void);
static void WriteActiveTestArea(void);
static void WriteInactiveTestArea(void);
static void BulkErase(void);
static void SequenceNumberUpdate(void);
static void BootSwapRequested(void);
static void SequenceInfoPrint(void);
static void SequenceNumberActiveErase(void);
static void SequenceNumberInactiveErase(void);
static void BreakpointDemo(void);

void MENU_Print(void);

enum TYPE {
    TYPE_GROUP,
    TYPE_COMMAND
};

struct COMMAND {
    enum TYPE type;
    char code;
    char description[100];
    void (*execute)(void);
};

static struct COMMAND commands[] = {
    // Sequence Number Options
    {
        .type = TYPE_GROUP,
        .description = "Sequence Number Options",
    },
    {
        .type = TYPE_COMMAND,
        .code = 's',
        .description = "Write the sequence number of the inactive partition",
        .execute = SequenceNumberUpdate
    },
    {
        .type = TYPE_COMMAND,
        .code = 'a',
        .description = "Erase active partition sequence number",
        .execute = SequenceNumberActiveErase
    },
    {
        .type = TYPE_COMMAND,
        .code = 'i',
        .description = "Erase inactive partition sequence number",
        .execute = SequenceNumberInactiveErase
    },
    
    // Flash Panel Lock & Unlock Options
    {
        .type = TYPE_GROUP,
        .description = "Flash Panel Lock & Unlock Options",
    },
    {
        .type = TYPE_COMMAND,
        .code = 'u',
        .description = "Set a flash protection region to UNLOCKED",
        .execute = UnlockRegion
    },
    {
        .type = TYPE_COMMAND,
        .code = 'l',
        .description = "Set a flash protection region to LOCKED",
        .execute = LockRegion
    },
    {
        .type = TYPE_COMMAND,
        .code = 'x',
        .description = "Set a flash protection region to LOCKED UNTIL RESET",
        .execute = LockRegionUntilReset
    },
    
    // Dual Partition Flash Protection Regions: Active Panel
    {
        .type = TYPE_GROUP,
        .description = "Active Partition - Dual Partition Flash Protection Regions (0x810000)",
    },
    {
        .type = TYPE_COMMAND,
        .code = 'p',
        .description = "Print the test area of the active partition",
        .execute = PrintActiveTestArea
    },
    {
        .type = TYPE_COMMAND,
        .code = 'e',
        .description = "Erase the test area of the active partition",
        .execute = EraseActiveTestArea
    },
    {
        .type = TYPE_COMMAND,
        .code = 'w',
        .description = "Write test data to the test area of the active partition",
        .execute = WriteActiveTestArea
    },
    
    // Dual Partition Flash Protection Regions: Inactive Panel
    {
        .type = TYPE_GROUP,
        .description = "Inactive Partition - Dual Partition Flash Protection Regions (0xC10000)",
    },
    {
        .type = TYPE_COMMAND,
        .code = 'P',
        .description = "Print the test area of the inactive partition",
        .execute = PrintInactiveTestArea
    },
    {
        .type = TYPE_COMMAND,
        .code = 'E',
        .description = "Erase the test area of the inactive partition",
        .execute = EraseInactiveTestArea
    },
    {
        .type = TYPE_COMMAND,
        .code = 'W',
        .description = "Write test data to the test area of the inactive partition",
        .execute = WriteInactiveTestArea
    },
    
    // Bootswap, Debug, & Reset Options
    {
        .type = TYPE_GROUP,
        .description = "Bootswap, Debug, & Reset Options",
    },
    {
        .type = TYPE_COMMAND,
        .code = 'b',
        .description = "Swap active/inactive partitions: BOOTSWP",
        .execute = BootSwapRequested
    },
    {
        .type = TYPE_COMMAND,
        .code = 'q',
        .description = "Run the breakpoint function",
        .execute = BreakpointDemo
    },
    {
        .type = TYPE_COMMAND,
        .code = 'r',
        .description = "Issue software RESET",
        .execute = RESET_DeviceReset
    },
};

