microchip-pic-avr-examples/dspic33a-dual-partition-code-examples/dspic33ak512mps512_dual_partition_demo/example0/shared_code/command.c
static struct FLASH_REGION * const flashRegion[] = 
{
    &flashRegion0,
    &flashRegion1,
    &flashRegion2,
    &flashRegion3,
    &flashRegion4,
    &flashRegion5,
    &flashRegion6,
    &flashRegion7,
};

static void BreakpointDemo(void)
{
    /* Wait until all UART data is transmitted before triggering the
     * breakpoint to prevent garbled terminal data. */
    while(UART1_IsTxDone() == false)
    {
    }

    BreakpointExample();
}

static void SequenceNumberActiveErase(void)
{
    (void)FLASH_PageErase(ACTIVE_SEQUENCE_NUMBER_PAGE, FLASH_UNLOCK_KEY);
}

static void SequenceNumberInactiveErase(void)
{
    (void)FLASH_PageErase(INACTIVE_SEQUENCE_NUMBER_PAGE, FLASH_UNLOCK_KEY);
}

/**
 * @ingroup  menu.c
 * @brief    Prints the menu options.
 * 
 * @param    none
 * @return   none
 */
void MENU_Print(void)
{
    (void)printf("\r\n");
    (void)printf("\r\n");
    (void)printf("=============================================\r\n");
    (void)printf("Dual Partition Demo\r\n");
    (void)printf("=============================================\r\n");

    RESET_PrintResetSources();
    
    /* Clear all sources */
    RCON = 0;
    
    (void)printf("\r\n");
    
    SequenceInfoPrint();
    
    for(size_t i=0; i<(sizeof(commands)/sizeof(struct COMMAND)); i++)
    {
        struct COMMAND* command = &commands[i];
        
        if(command->type == TYPE_GROUP){
            (void)printf("\r\n");
            (void)printf("  %s:\r\n", command->description);
            (void)printf("  -------------------------------------------\r\n");
        } else {
            (void)printf("    '%c' : %s\r\n", command->code, command->description);
        }
    }
    
//    (void)printf("  Erase Options:\r\n");
//    (void)printf("  -------------------------------------------\r\n");
//    (void)printf("    'e' : Erase the test area of the active partition\r\n");
//    (void)printf("    'p' : Print the test area of the active partition\r\n");
//    (void)printf("    'w' : Write the test area of the active partition\r\n");
//    (void)printf("    'c' : Read the config bits active partition\r\n");

//    (void)printf("    'E' : Erase the test area of the inactive partition\r\n");
//    (void)printf("    'P' : Print the test area of the inactive partition\r\n");
//    (void)printf("    'W' : Write the test area of the inactive partition\r\n");
//    (void)printf("    'C' : Read the config the inactive partition\r\n");

//    (void)printf("    't' : Inactive partition erase\r\n");
//    (void)printf("\r\n");
    
    (void)printf("\r\n");
    (void)printf("Command: ");
}

static void PrintRegion(uint32_t address)
{
    uint8_t data[PRINT_REGION_SIZE];
    
    memcpy(data, (void*)address, sizeof(data));
      
    for(int i=0; i<sizeof(data); i++){
        if((i % 16) == 0)
        {
            (void)printf("\r\n  %08lX: ", (unsigned long)(address + i));
        }
        
        printf(" %02lX ", (unsigned long)data[i]);
    }
    
    (void)printf("\r\n\r\n");
}

void COMMAND_Process(void)
{    
    MENU_Print();

    char command = SCAN_Char(true);

    (void)printf("\r\n\r\n");

    switch(command)
    {
        case 's':
            SequenceNumberUpdate();
            break;
        
        case 'a':
            (void)FLASH_PageErase(ACTIVE_SEQUENCE_NUMBER_PAGE, FLASH_UNLOCK_KEY);
            break;
        
        case 'i':
            (void)FLASH_PageErase(INACTIVE_SEQUENCE_NUMBER_PAGE, FLASH_UNLOCK_KEY);
            break;

        case 'u':
            UnlockRegion();
            break;
            
        case 'l':
            LockRegion();
            break;
            
        case 'x':
            LockRegionUntilReset();
            break;
            
        case 'e':
            EraseActiveTestArea();
            break;
            
        case 'E':
            EraseInactiveTestArea();
            break;
            
        case 'p':
            PrintActiveTestArea();
            break;
            
        case 'P':
            PrintInactiveTestArea();
            break;
            
        case 'w':
            WriteActiveTestArea();
            break;
            
        case 'W':
            WriteInactiveTestArea();
            break;
            
        case 'c':
            PrintRegion(0x7F3000);
            break;
            
        case 'C':
            PrintRegion(0x7FB000);
            break;
                    
        case 't':
            BulkErase();
            break;
            
        case 'b':
            BootSwapRequested();
            break;
                    
        case 'q':
            /* Wait until all UART data is transmitted before triggering the
             * breakpoint to prevent garbled terminal data. */
            while(UART1_IsTxDone() == false)
            {
            }
            
            BreakpointExample();
            break;
            
        case 'r':
            RESET_DeviceReset();
            break;

        default:
            (void)printf("Invalid request.\r\n");
            break;
    }
}


static void PrintActiveTestArea(void)
{
    PrintRegion(0x810000);
}

static void PrintInactiveTestArea(void)
{
    PrintRegion(0xC10000);
}

static void WriteActiveTestArea(void)
{
    flash_data_t data[PRINT_REGION_SIZE/4] = {
        0x00010203, 0x04050607, 0x08090A0B, 0x0C0D0E0F,
        0x10111213, 0x14151617, 0x18191A1B, 0x1C1D1E1F,
        0x20212223, 0x24252627, 0x28292A2B, 0x2C2D2E2F,
        0x30313233, 0x34353637, 0x38393A3B, 0x3C3D3E3F,
        0x40414243, 0x44454647, 0x48494A4B, 0x4C4D4E4F,
        0x50515253, 0x54555657, 0x58595A5B, 0x5C5D5E5F,
        0x60616263, 0x64656667, 0x68696A6B, 0x6C6D6E6F,
        0x70717273, 0x74757677, 0x78797A7B, 0x7C7D7E7F,
    };
        
    FLASH_WordWrite(0x810000, &data[0], FLASH_UNLOCK_KEY);
    FLASH_WordWrite(0x810010, &data[4], FLASH_UNLOCK_KEY);
    FLASH_WordWrite(0x810020, &data[8], FLASH_UNLOCK_KEY);
    FLASH_WordWrite(0x810030, &data[12], FLASH_UNLOCK_KEY);
    FLASH_WordWrite(0x810040, &data[16], FLASH_UNLOCK_KEY);
    FLASH_WordWrite(0x810050, &data[20], FLASH_UNLOCK_KEY);
    FLASH_WordWrite(0x810060, &data[24], FLASH_UNLOCK_KEY);
    FLASH_WordWrite(0x810070, &data[28], FLASH_UNLOCK_KEY);
    
    PrintRegion(0x810000);
}

