microchip-pic-avr-examples/dspic33a-dual-partition-code-examples/dspic33ak512mps512_dual_partition_demo/example0/shared_code/command.c
        (void)FLASH_PageErase(INACTIVE_SEQUENCE_NUMBER_PAGE, FLASH_UNLOCK_KEY);
        (void)FLASH_WordWrite(INACTIVE_SEQUENCE_NUMBER_ADDRESS, sequenceNumberArray, FLASH_UNLOCK_KEY);
    }
    else
    {
        (void)printf("\r\n\r\nSequence number not written\r\n\r\n");
    }
}

/**
 * @ingroup  command.c
 * @brief    Attempts to swap to the inactive partition.  NOTE: this function
 *           will not return if the swap was successful.  We disable the timer
 *           before the swap because aren't sure if the interrupt handling 
 *           routines in the inactive partition are configured identically to
 *           this partition.  In this demo we re-initialize the entire code base
 *           on a swap which covers the C initializer and interrupt
 *           configuration.
 * 
 *           If this function returns, then the swap has failed.
 * @param    none
 * @return   none
 */
static void BootSwapRequested(void)
{
    /* Stop the timer in case we swap. */
    TMR1_Stop();

    /* Swap partitions - this function will not return on a
     * successful swap. */
    BootSwap();

    /* If the above function returned, then the swap failed.
     * Print a message and restart the interrupts. */
    (void)printf("  BOOT SWAP FAILED!!\r\n\r\n");
    TMR1_Start();
}

/**
 * @ingroup  menu.c
 * @brief    Determines if the specified sequence number is valid or not.
 * 
 * @param    *sequenceCode - pointer to 128-bit sequence code.
 * @return   bool - true if sequence code is valid
 */
static bool SequenceCodeIsValid(const uint32_t *sequenceCode)
{
    bool codeIsValid = true;
    
    uint16_t BTSEQn = sequenceCode[0] & 0xFFFU;
    uint16_t IBTSEQn = (sequenceCode[0] >> 12) & 0xFFFU;
    
    if( (BTSEQn + IBTSEQn) != 0xFFFU){
        codeIsValid = false;
    }
    
    if((sequenceCode[0] >> 24) != 0U){
        codeIsValid = false;
    }
    
    if((sequenceCode[1] != 0U) ||
       (sequenceCode[2] != 0U) ||
       (sequenceCode[3] != 0U)){
        codeIsValid = false;
    }
    
    return codeIsValid;
}

/**
 * @ingroup  menu.c
 * @brief    Prints sequence number analysis of the specified address
 * 
 * @param    address - the address of the sequence number to analyze
 * @return   none
 */
static void SequenceCodePrint(uint32_t address)
{
    uint32_t sequenceCode[4];
    
    /* cppcheck-suppress misra-c2012-11.6
     * 
     *  (Rule 11.6) REQUIRED: Required: A cast shall not be performed between 
     *  pointer to void and an arithmetic type
     * 
     *  Reasoning: This copies the sequence code value of the requested 
     *  partition into the sequenceCode buffer. Because the address may be the 
     *  inactive partition and therefore lives outside of active partition, 
     *  there is no way to create an object at that address to reference so an 
     *  integer address is used for the address.
     */
    memcpy(sequenceCode, (void*) address, sizeof(sequenceCode));
    
    (void)printf(" @%08X [%08X, %08X, %08X, %08X]", (unsigned int)address, (unsigned int)sequenceCode[0], (unsigned int)sequenceCode[1], (unsigned int)sequenceCode[2], (unsigned int)sequenceCode[3]);
    
    if(SequenceCodeIsValid(sequenceCode) == false){
        (void)printf(" -- INVALID!!");
    }
    
    (void)printf("\r\n");
}

/**
 * @ingroup  menu.c
 * @brief    Prints out the sequence number information for both partitions.
 *           Indicates which partition is currently active and if the sequence
 *           numbers of each partition are valid.
 * 
 * @param    none
 * @return   none
 */
static void SequenceInfoPrint(void)
{
    (void)printf("  Active Partition   (Panel %u) : ", PARTITION_ActiveGet());
    SequenceCodePrint(ACTIVE_SEQUENCE_NUMBER_ADDRESS);
    (void)printf("  Inactive Partition (Panel %u) : ", PARTITION_InactiveGet());
    SequenceCodePrint(INACTIVE_SEQUENCE_NUMBER_ADDRESS);
}
